#                                           WARNING!!!!
# Умова була не зовсім зрозуміла, тому я інтерпретував завдання наступним чином:
# 1-Користувач вводить значення в файл і ці значення моментально зчитуються і перевіряються
# 2-При натисканні на Enter без тексту(пустий рядок) із циклу введення виходять
# 3-Сумуються всі ЦИФРИ. Саме цифри, а не числа, бо є принципова різниця, тому умова не зовсім зрозуміла
# 4-Все, що не є цифрою, ігнорується
# 5-При кожному введені потрібно виводити поточну суму, тобто суму в даний момент часу для конкретного введення
# 6-Треба просумувати всі цифри за весь час і вивести їх

elements = ('0', '1', '2', '3', '4', '5', '6', '7', '8', '9')
position = 0
total_all = 0
def check(e):
    for el in elements:                                 #Перевірка чи це цифра, чи ні
        if e == el:
            print(e)
            return True
    return False

while True:
    file = open('data/text.txt', 'a+')
    fi = file.write(input("Уведіть текст: ") + '\n')
    if fi == 1:                                         #Перевірка на пустий рядок (Enter)
        break
    total_one = 0
    file.seek(position)                                 #Вказівник на потрібне місце в файлі

    for line in file:
        for el in line:
            if check(el):
                position += 1
                total_one += int(el)
                total_all += int(el)
            else:
                print("Не цифра")                        #Якщо знак не цифра, то про це повідомляють
                position += 1
    print("Для одного:", total_one)                     #Сума цифр для одного введення

print("Для всіх:", total_all)                           #А також для всіх
file.seek(0)
file.truncate()                                          #Чистимо файл
file.close()
